{
    "administration": "Administración",
    "administration_description": "Módulo nivel administrador, permite visualizar y gestionar los flujos de la aplicación.",
    "calendar": "Calendario",
    "calendar_description": "Calendario de eventos de los usuarios.",
    "folders": "Carpetas",
    "folders_description": "Documentación de los usuarios, permite subir y gestionar documentos.",
    "files": "Archivos",
    "files_description": "Módulo de archivos, permite subir y gestionar archivos.",
    "files_access_levels": "Niveles de acceso a archivos",
    "files_access_levels_description": "Módulo de control de acceso a los archivos, permite gestionar el rango de visibilidad de los archivos.",
    "file_extensions": "Extensiones de archivos",
    "file_extensions_description": "Módulo de extensiones de archivos, permite gestionar las extensiones de los archivos.",
    "users": "Usuarios",
    "users_description": "Módulo de usuarios, permite gestionar los usuarios de la aplicación.",
    "teams": "Equipos",
    "teams_description": "Módulo de equipos, permite gestionar los equipos de la aplicación.",
    "employees": "Empleados",
    "employees_description": "Módulo de empleados, permite gestionar los empleados de la aplicación.",
    "addresses": "Direcciones",
    "addresses_description": "Módulo de direcciones, permite gestionar las direcciones de los diferentes Models.",
    "municipios": "Municipios",
    "municipios_description": "Módulo de municipios, permite gestionar los municipios de la aplicación.",
    "provincias": "Provincias",
    "provincias_description": "Módulo de provincias, permite gestionar las provincias de la aplicación.",
    "roles": "Roles",
    "roles_description": "Módulo de roles, permite gestionar los roles de la aplicación.",
    "permissions": "Permisos",
    "permissions_description": "Módulo de permisos, permite gestionar los permisos de la aplicación.",
    "modules": "Módulos",
    "modules_description": "Módulo de módulos, permite gestionar los módulos de la aplicación relacionado con los permisos, agrupación de permisos.",
    "links": "Enlaces",
    "links_description": "Módulo de enlaces, funcionalidad clave del sidebar, permite gestionar los enlaces de la aplicación.",
    "festivos": "Festivos",
    "festivos_description": "Módulo de festivos, permite gestionar los festivos de la aplicación.",
    "companies": "Empresas",
    "companies_description": "Módulo de empresas, permite gestionar las empresas de la aplicación.",
    "centers": "Centros",
    "centers_description": "Módulo de centros, permite gestionar los centros de la aplicación.",
    "departments": "Departamentos",
    "departments_description": "Módulo de departamentos, permite gestionar los departamentos de la aplicación.",
    "centers_departments": "Departamentos de centros",
    "centers_departments_description": "Módulo de centros departamentos, permite gestionar los departamentos de los centros de la aplicación.",
    "contracts": "Contratos",
    "contracts_description": "Módulo de contratos, permite gestionar los contratos de la aplicación.",
    "annexes": "Anexos",
    "annexes_description": "Módulo de anexos, permite gestionar los anexos de los contratos de la aplicación.",
    "assignments": "Asignaciones",
    "assignments_description": "Módulo de asignaciones, permite gestionar las asignaciones de los contratos de la aplicación.",
    "work_permits": "Permisos de trabajo",
    "work_permits_description": "Módulo de permisos de trabajo, permite gestionar los permisos de trabajo de la aplicación.",
    "work_permit_requests": "Solicitudes de permisos",
    "work_permit_requests_description": "Módulo de solicitudes de permisos de trabajo, permite gestionar las solicitudes de permisos de trabajo de la aplicación.",
    "events": "Eventos",
    "events_description": "Módulo de eventos, permite gestionar los eventos de la aplicación.",
    "notifications": "Notificaciones",
    "notifications_description": "Módulo de notificaciones, permite gestionar las notificaciones de la aplicación.",
    "schedule": "Horarios",
    "schedule_description": "Módulo de horarios, permite gestionar los horarios de la aplicación.",
    "absences_notes": "Justificantes",
    "absences_notes_description": "Módulo de justificantes, permite gestionar las justificantes de la aplicación.",
    "shifts": "Turnos",
    "shifts_description": "Módulo de turnos, permite gestionar los turnos de la aplicación.",
    "work_days": "Jornadas laborales",
    "work_days_description": "Módulo de jornadas laborales, permite gestionar las jornadas laborales de la aplicación."
}